app/views/article_submissions/_contribution_types.html.erb


	<% ContributionType.find_all_by_public('1', :order => :display_order).each do |ctype| %>
---
SELECT `contribution_types`.* FROM `contribution_types` WHERE (`contribution_types`.`public` = '1') ORDER BY display_order