app/views/users/_subjects.html.erb

  <div>
    <%= check_box_tag "article_section_ids[]", subject.id, @user.article_sections.include?(subject) %>
---
SELECT `article_sections`.*, `article_sections`.`article_section_id` FROM `article_sections` INNER JOIN `reviewer_subjects` ON `article_sections`.article_section_id = `reviewer_subjects`.article_section_id WHERE ((`reviewer_subjects`.user_id = NULL)) AND (`article_sections`.`article_section_id` = 63) LIMIT 1