app/controllers/article_submissions_controller.rb

SELECT `manuscript_types`.* FROM `manuscript_types` WHERE (`manuscript_types`.`id` = 1) LIMIT 1
---
  def new
    @article_submission = ArticleSubmission.new
    type = ManuscriptType.find_by_id(params[:type_id])

INSERT INTO `contribution_types_contributions` (`contribution_type_id`, `contribution_id`) VALUES (1, 1)
INSERT INTO `contribution_types` (`display_order`, `title`, `public`) VALUES (0, 'dssa', 0)
---
  def create
    @article_submission = ArticleSubmission.new(params[:article_submission])
    @article_submission.create_by_ip = request.remote_ip
    if current_user
	@article_submission.create_by_id = current_user.id
    else
	@article_submission.create_by_id = 0
    end

    @article_submission.form_state = :general
    @contribution = Contribution.new
    has_contr = params.has_key?(:contribution_types) || !params[:contribution_type_other].blank?
    if @article_submission.valid? && has_contr
        @article_submission.save
        @article_submission.change_status("article_submission_started")
        @contribution.article_submission_id = @article_submission.id
        @contribution.user_id = @user.id
        @contribution.role_id = 1
      if update_contribution_types(@contribution, params) and @contribution.save

SELECT `manuscript_types`.* FROM `manuscript_types` WHERE (`manuscript_types`.`id` = 1) LIMIT 1
---
        flash[:error] = "You must enter a contribution type"
     end

     type = ManuscriptType.find_by_id(params[:article_submission][:manuscript_type_id])

UPDATE `article_submissions` SET `mod_by_ip` = '192.168.1.100', `mod_by_id` = 1, `mod_date` = '2010-12-16 14:05:07', `updated_at` = '2010-12-16 14:05:07', `reviewer1` = NULL, `reviewer2` = NULL, `reviewer3` = NULL WHERE (`article_submissions`.`id` = 1)
---
  def update_reviewers
    @article_submission.form_state = :reviewers

    #logger.info("***** #{params.inspect}")
    [1,2,3].each do |n|
      @article_submission.write_attribute_3("reviewer#{n}".to_sym, params["reviewer#{n}"])
      #logger.info("***** writing reviewer#{n} info: #{@article_submission.send('reviewer'+n.to_s).inspect} params: #{params['reviewer' + n.to_s]} ***")
    end


    if @article_submission.save and @article_submission.reviewers_valid?

UPDATE `article_submissions` SET `invited` = 1, `is_letter` = 1, `cant_pay_reason` = '', `mod_date` = '2010-12-16 14:05:20', `updated_at` = '2010-12-16 14:05:20', `reviewer1` = NULL, `reviewer2` = NULL, `reviewer3` = NULL WHERE (`article_submissions`.`id` = 1)
---
  def update_fees
    @article_submission.form_state = :fees
    redirect_to :action => fees unless request.post?

    if params[:article_submission][:invited] == '0'
      params[:article_submission].delete(:invited)
      @article_submission.invited = 0
    end
    no_problems = true
    @article_submission.update_attributes(params[:article_submission]) or no_problems = false

UPDATE `article_submissions` SET `has_gap_and_learn_objs` = 1, `learn_obj_1` = 'sa', `learn_obj_2` = 'sa', `learn_obj_3` = 'as', `learn_obj_4` = 'sa', `gap_1` = 'as', `gap_2` = 'as', `gap_3` = 's', `gap_4` = 'a', `gap_5` = 's', `gap_6` = 's', `gap_7` = '', `gap_8` = '', `gap_9` = '', `indemnify` = 1, `mod_date` = '2010-12-16 14:05:54', `updated_at` = '2010-12-16 14:05:54', `reviewer1` = NULL, `reviewer2` = NULL, `reviewer3` = NULL WHERE (`article_submissions`.`id` = 1)
---
  def update_checklist
    @article_submission.form_state = :checklist
    if @article_submission.update_attributes(params[:article_submission])

SELECT `article_submissions`.* FROM `article_submissions` WHERE (`article_submissions`.`id` = 1) LIMIT 1
SELECT `article_submissions`.*, `article_submissions`.`id` FROM `article_submissions` INNER JOIN `contributions` ON `article_submissions`.id = `contributions`.article_submission_id WHERE ((`contributions`.user_id = 1)) AND (`article_submissions`.`id` = 1) ORDER BY article_submissions.create_date DESC LIMIT 1
---
  def load_article_submission
    begin
      @article_submission = ArticleSubmission.find(params[:id])
    rescue
      flash[:notice] = "I could not find your Manuscript Submission."
      redirect_to :action=>'new'
      return
    end

    # Ensure they're editing their article and not somebody else's
    if ! @user.article_submissions.include?(@article_submission)