app/controllers/manuscript_types_controller.rb

  def links
    @manuscript_types = ManuscriptType.find(:all,:conditions=>{:enabled=>true},:order => "order_num")
---
SELECT `manuscript_types`.* FROM `manuscript_types` WHERE (`manuscript_types`.`enabled` = 1) ORDER BY order_num