app/controllers/manuscripts_controller.rb

  def index
    @active_submissions = Array.new
    @committed_submissions = Array.new
    @submissions = Array.new
    #@submissions.concat(@user.article_submissions.select{|as|as.version.nil? || as.version==1})
    @submissions.concat(@user.article_submissions.select{|as|as.last_revision==true})

    #TODO clean this code up
    @review_instances = @user.article_submission_reviewers.select{|r|r.has_had_status?("reviewer_accepted")}
    @reviewed_submissions = @review_instances.collect{|r|r.article_submission}
    @submissions.each do |as|
      if !as.article_submissions.empty?
---
SELECT `article_submission_reviewers`.* FROM `article_submission_reviewers` WHERE (`article_submission_reviewers`.user_id = 1)
SELECT COUNT(*) FROM `article_submissions` WHERE (`article_submissions`.parent_id = 1)

  def create
  	@manuscript = Manuscript.create(params[:manuscript])
---
INSERT INTO `manuscripts` (`file_content_type`, `file`, `version`, `article_submission_id`, `file_size`, `created_at`, `updated_at`, `pfile_file_name`, `pfile_content_type`, `pfile_file_size`) VALUES (NULL, NULL, 0, NULL, NULL, '2010-12-16 14:42:03', '2010-12-16 14:42:03', 'Test.doc', 'application/msword', 26624)

  def load_article_submission
    begin
      @article_submission = ArticleSubmission.find(params[:id])
    rescue
      flash[:notice] = "I could not find your Manuscript Submission."
      redirect_to :action=>'new'
      return
    end

    # Ensure they're editing their article and not somebody else's
    if !@article_submission.authors.include?(@user) and !@article_submission.reviewers.include?(@user)
---
SELECT `article_submissions`.* FROM `article_submissions` WHERE (`article_submissions`.`id` = 1) LIMIT 1
SELECT `article_submissions`.* FROM `article_submissions` INNER JOIN `contributions` ON `article_submissions`.id = `contributions`.article_submission_id WHERE ((`contributions`.user_id = 1)) ORDER BY article_submissions.create_date DESC