app/controllers/users_controller.rb

INSERT INTO `users` (`create_date`, `create_by_id`, `create_by_ip`, `mod_date`, `mod_by_id`, `mod_by_ip`, `active_status_id`, `display_order`, `username`, `password`, `temp_password_flag`, `security_level`, `pre_title`, `first_name`, `middle_name`, `last_name`, `email`, `ok_to_email`, `last_login`, `last_login_ip`, `login_count`, `last_login_attempt`, `last_login_ip_attempt`, `failed_login_count`, `lost_password_count`, `employer`, `department`, `position_title`, `address_1`, `address_2`, `city`, `state_province_id`, `zip_postalcode`, `country_id`, `phone_preferred`, `phone_work`, `phone_work_ext`, `phone_cell`, `phone_fax`, `assistant_name`, `assistant_email`, `assistant_phone`, `cc_emails_to_asst`, `notes`, `degree1`, `degree2`, `degree3`, `page_id`, `degree1_other`, `degree2_other`, `degree3_other`, `url`, `remember_token`, `remember_token_expires_at`, `secret_token`, `auto_created`, `user_can_edit`, `supress_email`, `disabled`) VALUES ('2010-12-16 14:04:04', 0, '192.168.1.100', '2010-12-16 14:04:04', NULL, NULL, 2, NULL, 'npatkar@gmail.com', 'f7a9e24777ec23212c54d7a350bc5bea5477fdbb', 0, 2, 'Dr.', 'Nilesh', 'A', 'Patkar', 'npatkar@gmail.com', 1, NULL, NULL, 0, NULL, NULL, NULL, NULL, 'adssd', '', 'ss', 'asassa', '', 'mumbai', 14, '100001', 223, '2121221', NULL, NULL, NULL, '2121221', NULL, NULL, NULL, NULL, NULL, 'DHA', 'MD', NULL, NULL, '', '', NULL, '', NULL, NULL, 'a8847768a5f9b8a01', NULL, NULL, NULL, NULL)
---
  def signup
    @user = User.new(params[:user])

    return unless request.post?

    @user.set_defaults
    @user.create_by_ip = request.remote_ip