app/views/manuscripts/_files.html.erb

    <% if !@article_submission.hiding_original_file_or_files?(:additional_files)%>
      <% @article_submission.additional_files_to_show.each do |additional_file| %>
---
SELECT `additional_files`.* FROM `additional_files` WHERE (`additional_files`.article_submission_id = 1)


<%unless @article_submission.parent.article_submissions.empty? %>
---
SELECT COUNT(*) FROM `article_submissions` WHERE (`article_submissions`.parent_id = 1)